redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_F_OFF_2nd/redis_result_Sequential82_F_OFF_P2_2nd_20230717233341.log
20        Threads
5         Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8095.41          ---          ---         2.46883         2.41500         4.89500         5.21500      8735.77 
Gets        32374.30     32374.30         0.00         2.46782         2.41500         4.86300         5.18300     34777.08 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      40469.71     32374.30         0.00         2.46803         2.41500         4.86300         5.18300     43512.85 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.199        0.000
SET       2.143        5.000
SET       2.223       10.000
SET       2.287       15.000
SET       2.319       20.000
SET       2.351       25.000
SET       2.367       30.000
SET       2.383       35.000
SET       2.399       40.000
SET       2.415       45.000
SET       2.415       50.000
SET       2.431       52.500
SET       2.431       55.000
SET       2.447       57.500
SET       2.447       60.000
SET       2.463       62.500
SET       2.463       65.000
SET       2.479       67.500
SET       2.479       70.000
SET       2.479       72.500
SET       2.495       75.000
SET       2.495       76.250
SET       2.511       77.500
SET       2.511       78.750
SET       2.511       80.000
SET       2.511       81.250
SET       2.527       82.500
SET       2.527       83.750
SET       2.543       85.000
SET       2.543       86.250
SET       2.543       87.500
SET       2.559       88.125
SET       2.559       88.750
SET       2.559       89.375
SET       2.575       90.000
SET       2.575       90.625
SET       2.575       91.250
SET       2.575       91.875
SET       2.591       92.500
SET       2.591       93.125
SET       2.607       93.750
SET       2.607       94.062
SET       2.607       94.375
SET       2.623       94.688
SET       2.623       95.000
SET       2.623       95.312
SET       2.639       95.625
SET       2.639       95.938
SET       2.639       96.250
SET       2.655       96.562
SET       2.671       96.875
SET       2.687       97.031
SET       2.735       97.188
SET       3.007       97.344
SET       3.663       97.500
SET       4.351       97.656
SET       4.511       97.812
SET       4.639       97.969
SET       4.671       98.125
SET       4.735       98.281
SET       4.767       98.438
SET       4.767       98.516
SET       4.799       98.594
SET       4.799       98.672
SET       4.831       98.750
SET       4.831       98.828
SET       4.863       98.906
SET       4.895       98.984
SET       4.895       99.062
SET       4.927       99.141
SET       4.927       99.219
SET       4.927       99.258
SET       4.959       99.297
SET       4.959       99.336
SET       4.959       99.375
SET       4.959       99.414
SET       4.991       99.453
SET       4.991       99.492
SET       4.991       99.531
SET       5.023       99.570
SET       5.023       99.609
SET       5.023       99.629
SET       5.055       99.648
SET       5.055       99.668
SET       5.055       99.688
SET       5.055       99.707
SET       5.087       99.727
SET       5.087       99.746
SET       5.087       99.766
SET       5.119       99.785
SET       5.119       99.805
SET       5.119       99.814
SET       5.119       99.824
SET       5.151       99.834
SET       5.151       99.844
SET       5.151       99.854
SET       5.151       99.863
SET       5.183       99.873
SET       5.183       99.883
SET       5.183       99.893
SET       5.215       99.902
SET       5.215       99.907
SET       5.215       99.912
SET       5.215       99.917
SET       5.215       99.922
SET       5.215       99.927
SET       5.247       99.932
SET       5.247       99.937
SET       5.247       99.941
SET       5.247       99.946
SET       5.279       99.951
SET       5.279       99.954
SET       5.279       99.956
SET       5.279       99.958
SET       5.311       99.961
SET       5.311       99.963
SET       5.311       99.966
SET       5.343       99.968
SET       5.343       99.971
SET       5.375       99.973
SET       5.439       99.976
SET       5.439       99.977
SET       5.535       99.978
SET       5.599       99.979
SET       5.663       99.980
SET       5.695       99.982
SET       5.759       99.983
SET       5.791       99.984
SET       5.823       99.985
SET       5.887       99.987
SET       6.015       99.988
SET       6.079       99.988
SET       6.111       99.989
SET       6.175       99.990
SET       6.271       99.990
SET       6.367       99.991
SET       6.399       99.991
SET       6.655       99.992
SET       6.815       99.993
SET       7.071       99.993
SET       7.199       99.994
SET       7.327       99.994
SET       7.391       99.995
SET       7.519       99.995
SET       9.151       99.995
SET       9.599       99.995
SET      10.239       99.996
SET     413.695       99.996
SET     413.695       99.996
SET     413.695       99.997
SET     413.695       99.997
SET     413.695       99.997
[...]
SET     413.695       99.998
SET     413.695       99.998
SET     413.695       99.998
[...]
SET     413.695       99.999
SET     413.695       99.999
SET     413.695       99.999
[...]
SET     413.695      100.000
SET     413.695      100.000
SET     413.695      100.000
[...]
SET     415.743      100.000
SET     415.743      100.000
---
GET       0.511        0.000
GET       2.143        5.000
GET       2.223       10.000
GET       2.287       15.000
GET       2.319       20.000
GET       2.335       25.000
GET       2.367       30.000
GET       2.383       35.000
GET       2.383       40.000
GET       2.399       45.000
GET       2.415       50.000
GET       2.431       52.500
GET       2.431       55.000
GET       2.447       57.500
GET       2.447       60.000
GET       2.463       62.500
GET       2.463       65.000
GET       2.463       67.500
GET       2.479       70.000
GET       2.479       72.500
GET       2.495       75.000
GET       2.495       76.250
GET       2.495       77.500
GET       2.511       78.750
GET       2.511       80.000
GET       2.511       81.250
GET       2.527       82.500
GET       2.527       83.750
GET       2.527       85.000
GET       2.543       86.250
GET       2.543       87.500
GET       2.559       88.125
GET       2.559       88.750
GET       2.559       89.375
GET       2.559       90.000
GET       2.575       90.625
GET       2.575       91.250
GET       2.575       91.875
GET       2.591       92.500
GET       2.591       93.125
GET       2.591       93.750
GET       2.607       94.062
GET       2.607       94.375
GET       2.607       94.688
GET       2.607       95.000
GET       2.623       95.312
GET       2.623       95.625
GET       2.639       95.938
GET       2.639       96.250
GET       2.639       96.562
GET       2.655       96.875
GET       2.671       97.031
GET       2.687       97.188
GET       2.719       97.344
GET       2.911       97.500
GET       3.519       97.656
GET       4.351       97.812
GET       4.543       97.969
GET       4.639       98.125
GET       4.703       98.281
GET       4.735       98.438
GET       4.767       98.516
GET       4.767       98.594
GET       4.799       98.672
GET       4.799       98.750
GET       4.831       98.828
GET       4.831       98.906
GET       4.863       98.984
GET       4.895       99.062
GET       4.895       99.141
GET       4.927       99.219
GET       4.927       99.258
GET       4.927       99.297
GET       4.959       99.336
GET       4.959       99.375
GET       4.959       99.414
GET       4.959       99.453
GET       4.991       99.492
GET       4.991       99.531
GET       5.023       99.570
GET       5.023       99.609
GET       5.023       99.629
GET       5.023       99.648
GET       5.055       99.668
GET       5.055       99.688
GET       5.055       99.707
GET       5.087       99.727
GET       5.087       99.746
GET       5.087       99.766
GET       5.087       99.785
GET       5.119       99.805
GET       5.119       99.814
GET       5.119       99.824
GET       5.119       99.834
GET       5.151       99.844
GET       5.151       99.854
GET       5.151       99.863
GET       5.151       99.873
GET       5.183       99.883
GET       5.183       99.893
GET       5.183       99.902
GET       5.183       99.907
GET       5.183       99.912
GET       5.183       99.917
GET       5.215       99.922
GET       5.215       99.927
GET       5.215       99.932
GET       5.215       99.937
GET       5.215       99.941
GET       5.247       99.946
GET       5.247       99.951
GET       5.247       99.954
GET       5.247       99.956
GET       5.247       99.958
GET       5.247       99.961
GET       5.279       99.963
GET       5.279       99.966
GET       5.279       99.968
GET       5.311       99.971
GET       5.311       99.973
GET       5.343       99.976
GET       5.343       99.977
GET       5.375       99.978
GET       5.407       99.979
GET       5.503       99.980
GET       5.567       99.982
GET       5.663       99.983
GET       5.759       99.984
GET       5.823       99.985
GET       5.919       99.987
GET       5.983       99.988
GET       6.047       99.988
GET       6.143       99.989
GET       6.175       99.990
GET       6.239       99.990
GET       6.271       99.991
GET       6.367       99.991
GET       6.655       99.992
GET       7.039       99.993
GET       7.327       99.993
GET       7.647       99.994
GET       8.447       99.994
GET       9.151       99.995
GET       9.727       99.995
GET     413.695       99.995
GET     413.695       99.995
GET     413.695       99.996
GET     413.695       99.996
GET     413.695       99.996
GET     413.695       99.997
GET     413.695       99.997
GET     413.695       99.997
[...]
GET     413.695       99.998
GET     413.695       99.998
GET     413.695       99.998
[...]
GET     413.695       99.999
GET     413.695       99.999
GET     413.695       99.999
[...]
GET     415.743       99.999
GET     415.743       99.999
GET     415.743       99.999
[...]
GET     415.743      100.000
GET     415.743      100.000
GET     415.743      100.000
[...]
GET     417.791      100.000
GET     417.791      100.000
GET     417.791      100.000
[...]
GET     419.839      100.000
GET     419.839      100.000
---
WAIT      0.000      100.000